// 산술연산자
//console.log(`100+200=${100 + 200}`);
//console.log(`100+200=${100 - 200}`);
//console.log(`100+200=${100 / 200}`);
//console.log(`100*200=${100 * 200}`);
//console.log(`8+3=${8 % 3}`); // 나머지 연산자
//console.log(`100**2=${100 ** 2}`); // 제곱

let  t1 = "망고는";
let  t2 = "8";
let  t3 = "살";
let  t4 =  true;
let  t5 ;
console.log(`자료형은: t1: ${typeof  t1}/t2: ${typeof  t2}/t3: ${typeof  t3}/t4: ${typeof  t4} /// t5:${typeof t5}`);
t5=t1 + t2;
console.log(`${typeof t5}/// ${t5}`);
// 자료형이 바뀌는것은 예상치 못한 결과가 나옴
let  mon=1;
let text1="월"
let text2 = "일"
/*자바스크립트 - 동적타입언어: 필요에 따라 달라짐

데이터(값)의 타입에 따라 변함

개발자가 예측할수 없는 오류(버그)가 발생할수 있음

디버깅(유지보수)을 많이 해야함

업무가 유연함

다른언어 쓰임새를 작성*/
/*
타입스크립트 : 자바스크립트의 슈파셋
정적타입언어
초기 개발 속도저하 (개발자의 숙련도, 코드가 길어짐)
유지보수개선
ts
*/